Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПараметрыIRT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыIRT</Name>
			<Comment>Параметры b и a модели IRT для заданий банка по версиям калибровки.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТрудностьB</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДискриминативностьA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКалибровки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКалибровкиЗадания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаКалибровки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОтветовВВыборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыСобытийАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытийАналитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеМатериала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоСессииТеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБейджа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ПричиныНачисленияБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныНачисленияБаллов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВерныйОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеТемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрохождениеКурса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБейджа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучноеНачисление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтатусыКалибровкиЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКалибровкиЗадания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдётКалибровка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыТестовыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТестовыхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдиночныйВыбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МножественныйВыбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сопоставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упорядочивание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытыйОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФрагментКода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/ТестовыеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТестовыеЗадания</Name>
			<Comment>Банк тестовых заданий с параметрами IRT (b, a)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестовыхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстПредъявления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимыйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяПравильным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭталонныйОтвет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/АдаптивноеТестирование/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Открывает новую сессию адаптивного тестирования.
//
// Параметры:
//  Обучающийся - Строка                     - ФИО (TODO: заменить на CatalogRef.Пользователи).
//  Тема        - СправочникСсылка.Темы      - предметная тема сессии.
//
// Возвращаемое значение:
//  Структура:
//   * Сессия        - ДокументСсылка.ПопыткаТеста      - ссылка на созданную сессию или Неопределено.
//   * ПервоеЗадание - СправочникСсылка.ТестовыеЗадания - первое подобранное задание или Неопределено.
//   * Ошибка        - Строка                           - текст ошибки (пустая строка при успехе).
//
Функция НачатьСессию(Знач Обучающийся, Знач Тема) Экспорт
    
    Результат = Новый Структура("Сессия, ПервоеЗадание, Ошибка", Неопределено, Неопределено, "");

    Попытка
        // Создание сессии и фиксация события — в транзакции (без внешних вызовов).
        НачатьТранзакцию();
        Попытка
            Сессия = Документы.ПопыткаТеста.СоздатьДокумент();
            Сессия.Дата = ТекущаяДатаСеанса();
            Сессия.Обучающийся = Обучающийся;
            Сессия.Тема = Тема;
            Сессия.ДатаНачала = ТекущаяДатаСеанса();
            Сессия.СтатусСессии = "Активна";
            Сессия.ЧислоЗаданий = 0;
            Сессия.Записать();

            АналитикаПрогресса.ЗарегистрироватьСобытие(
                Обучающийся, Тема, Перечисления.ТипыСобытийАналитики.НачалоСессииТеста,
                Новый Структура, Сессия.Ссылка);

            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию();
            ВызватьИсключение;
        КонецПопытки;

        Результат.Сессия = Сессия.Ссылка;

        // Подбор первого задания выполняется ВНЕ транзакции (обращается к микросервису).
        НачальнаяТета = ПолучитьНачальнуюТета(Обучающийся, Тема);
        Кандидаты = ПолучитьКандидатовЗаданийПоТеме(Тема);
        Результат.ПервоеЗадание = ВыбратьСледующееЗадание(
            Кандидаты, НачальнаяТета, Новый Соответствие);

    Исключение
        Результат.Ошибка = ОписаниеОшибки();
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "АдаптивноеТестирование.НачатьСессию", Результат.Ошибка);
    КонецПопытки;

    Возврат Результат;

КонецФункции

// Регистрирует ответ обучающегося, обновляет θ и SE, выбирает следующее задание.
//
// Параметры:
//  СессияСсылка  - ДокументСсылка.ПопыткаТеста      - сессия тестирования.
//  ЗаданиеСсылка - СправочникСсылка.ТестовыеЗадания - предъявленное задание.
//  ВариантОтвета - Число  - индекс выбранного варианта ответа.
//  ТекстОтвета   - Строка - текст ответа для открытых заданий.
//  ВремяОтклика  - Число  - время ответа, секунд.
//  Верно         - Булево - признак правильного ответа.
//
// Возвращаемое значение:
//  Структура:
//   * СледующееЗадание - СправочникСсылка.ТестовыеЗадания - следующее задание или Неопределено.
//   * ТекущаяТета      - Число  - текущая оценка θ.
//   * ТекущаяSE        - Число  - стандартная ошибка оценки θ.
//   * ЗавершитьСессию  - Булево - признак завершения сессии.
//   * Ошибка           - Строка - текст ошибки (пустая строка при успехе).
//
Функция ОбработатьОтвет(Знач СессияСсылка, Знач ЗаданиеСсылка,
                        Знач ВариантОтвета, Знач ТекстОтвета,
                        Знач ВремяОтклика, Знач Верно) Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить("СледующееЗадание", Неопределено);
    Результат.Вставить("ТекущаяТета",      0);
    Результат.Вставить("ТекущаяSE",        99);
    Результат.Вставить("ЗавершитьСессию",  Ложь);
    Результат.Вставить("Ошибка",           "");

    Попытка
        Сессия = СессияСсылка.ПолучитьОбъект();
        НомерШага = Сессия.Ответы.Количество() + 1;
        
        // Получить параметры задания (последняя версия)
        ПараметрыЗадания = ПолучитьПараметрыЗадания(ЗаданиеСсылка);
        
        // Собрать историю ответов (все предыдущие + текущий)
        Историк = СобратьИсториюОтветовСессии(Сессия);
        Историк.Добавить(Новый Структура("ТрудностьB, Верно",
            ПараметрыЗадания.ТрудностьB, Верно));
        
        // Оценка θ через микросервис (при недоступности — локально). ВНЕ транзакции.
        ОценкаТета = ОценитьТета(Историк);
        Результат.ТекущаяТета = ОценкаТета.Тета;
        Результат.ТекущаяSE  = ОценкаТета.SE;

        // Запись ответа и события — в транзакции (без внешних вызовов).
        НачатьТранзакцию();
        Попытка
            // Записать строку в ТЧ Ответы
            НовыйОтвет = Сессия.Ответы.Добавить();
            НовыйОтвет.НомерШага         = НомерШага;
            НовыйОтвет.Задание           = ЗаданиеСсылка;
            НовыйОтвет.ВариантОтвета     = ВариантОтвета;
            НовыйОтвет.ТекстОтвета       = ТекстОтвета;
            НовыйОтвет.Верно             = Верно;
            НовыйОтвет.Время             = ВремяОтклика;
            НовыйОтвет.ТекущаяОценкаТета = ОценкаТета.Тета;
            НовыйОтвет.ТекущаяSE         = ОценкаТета.SE;

            Сессия.ЧислоЗаданий = НомерШага;
            Сессия.Записать();

            // Зафиксировать событие
            АналитикаПрогресса.ЗарегистрироватьСобытие(
                Сессия.Обучающийся, Сессия.Тема,
                Перечисления.ТипыСобытийАналитики.ОтветНаЗадание,
                Новый Структура("Задание, Верно, Тета", Строка(ЗаданиеСсылка), Верно, ОценкаТета.Тета),
                Сессия.Ссылка);

            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию();
            ВызватьИсключение;
        КонецПопытки;

        // Критерий остановки и подбор следующего задания — ВНЕ транзакции.
        Результат.ЗавершитьСессию = ПроверитьКритерийОстановки(Сессия, ОценкаТета);

        Если Не Результат.ЗавершитьСессию Тогда
            Кандидаты = ПолучитьКандидатовЗаданийПоТеме(Сессия.Тема);
            Использованные = Новый Соответствие;
            Для Каждого Стр Из Сессия.Ответы Цикл
                Использованные.Вставить(Стр.Задание, Истина);
            КонецЦикла;
            Результат.СледующееЗадание = ВыбратьСледующееЗадание(
                Кандидаты, ОценкаТета.Тета, Использованные);

            // Если кандидатов больше нет — завершить
            Если Результат.СледующееЗадание = Неопределено Тогда
                Результат.ЗавершитьСессию = Истина;
            КонецЕсли;
        КонецЕсли;

        Если Результат.ЗавершитьСессию Тогда
            ЗавершитьСессию(СессияСсылка);
        КонецЕсли;

    Исключение
        Результат.Ошибка = ОписаниеОшибки();
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "АдаптивноеТестирование.ОбработатьОтвет", Результат.Ошибка);
    КонецПопытки;
    
    Возврат Результат;
    
КонецФункции

// Завершает сессию: фиксирует итоговую оценку, обновляет регистр оценок,
// начисляет баллы и фиксирует событие.
//
// Параметры:
//  СессияСсылка - ДокументСсылка.ПопыткаТеста - завершаемая сессия.
//
Процедура ЗавершитьСессию(Знач СессияСсылка) Экспорт
    
    Попытка
        Сессия = СессияСсылка.ПолучитьОбъект();
        Если Сессия.СтатусСессии = "Завершена" Тогда
            Возврат;
        КонецЕсли;
        
        Сессия.ДатаОкончания = ТекущаяДатаСеанса();
        Сессия.СтатусСессии = "Завершена";
        
        Если Сессия.Ответы.Количество() > 0 Тогда
            ПоследнийОтвет = Сессия.Ответы[Сессия.Ответы.Количество() - 1];
            Сессия.ИтоговаяОценкаТета = ПоследнийОтвет.ТекущаяОценкаТета;
            Сессия.ИтоговаяSE         = ПоследнийОтвет.ТекущаяSE;
        КонецЕсли;
        Сессия.Записать();
        
        ЗаписатьИтоговуюОценку(Сессия.Ссылка);
        
        // Начислить баллы за каждый правильный ответ
        Для Каждого Стр Из Сессия.Ответы Цикл
            Если Стр.Верно Тогда
                Геймификация.НачислитьБаллы(
                    Сессия.Обучающийся, Сессия.Тема,
                    Перечисления.ПричиныНачисленияБаллов.ВерныйОтвет,
                    1, Сессия.Ссылка);
            КонецЕсли;
        КонецЦикла;
        
        // Проверить условия бейджей
        Геймификация.ПроверитьУсловияБейджей(Сессия.Обучающийся);
        
        АналитикаПрогресса.ЗарегистрироватьСобытие(
            Сессия.Обучающийся, Сессия.Тема,
            Перечисления.ТипыСобытийАналитики.ЗавершениеСессии,
            Новый Структура("ИтоговаяТета, ИтоговаяSE, ЧислоЗаданий",
                Сессия.ИтоговаяОценкаТета, Сессия.ИтоговаяSE, Сессия.ЧислоЗаданий),
            Сессия.Ссылка);
        
    Исключение
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "АдаптивноеТестирование.ЗавершитьСессию", ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

// Записывает итоговую оценку θ в регистр ОценкиПодготовленностиПоТемам.
//
// Параметры:
//  СессияСсылка - ДокументСсылка.ПопыткаТеста - завершённая сессия.
//
Процедура ЗаписатьИтоговуюОценку(Знач СессияСсылка) Экспорт
    
    Сессия = СессияСсылка.ПолучитьОбъект();
    // Пишем одну запись по ключу (Период + Пользователь + Тема) через менеджер записи.
    // Набор записей без отбора с Записать(Истина) затирал бы весь регистр целиком,
    // оставляя только последнюю оценку - история по темам и сессиям сохраняется.
    МенеджерЗаписи = РегистрыСведений.ОценкиПодготовленностиПоТемам.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Период       = Сессия.ДатаОкончания;
    МенеджерЗаписи.Пользователь = Сессия.Обучающийся;
    МенеджерЗаписи.Тема         = Сессия.Тема;
    МенеджерЗаписи.Тета         = Сессия.ИтоговаяОценкаТета;
    МенеджерЗаписи.SE           = Сессия.ИтоговаяSE;
    МенеджерЗаписи.Источник     = СессияСсылка;
    МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

// Подбирает следующее задание для активной сессии — для возобновления её в форме.
// θ берётся из последнего ответа (или начальная), исключаются уже предъявленные задания.
//
// Параметры:
//  СессияСсылка - ДокументСсылка.ПопыткаТеста - возобновляемая сессия.
//
// Возвращаемое значение:
//  СправочникСсылка.ТестовыеЗадания, Неопределено - следующее задание или Неопределено,
//      если кандидатов больше нет.
//
Функция ПодобратьСледующееЗаданиеСессии(Знач СессияСсылка) Экспорт

    Сессия = СессияСсылка.ПолучитьОбъект();

    Если Сессия.Ответы.Количество() > 0 Тогда
        ТекущаяТета = Сессия.Ответы[Сессия.Ответы.Количество() - 1].ТекущаяОценкаТета;
    Иначе
        ТекущаяТета = ПолучитьНачальнуюТета(Сессия.Обучающийся, Сессия.Тема);
    КонецЕсли;

    Использованные = Новый Соответствие;
    Для Каждого Стр Из Сессия.Ответы Цикл
        Использованные.Вставить(Стр.Задание, Истина);
    КонецЦикла;

    Кандидаты = ПолучитьКандидатовЗаданийПоТеме(Сессия.Тема);
    Возврат ВыбратьСледующееЗадание(Кандидаты, ТекущаяТета, Использованные);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает начальную θ из последней оценки пользователя по теме.
// При отсутствии истории возвращает 0 (среднюю способность).
//
Функция ПолучитьНачальнуюТета(Знач Обучающийся, Знач Тема)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   СрезПоследних.Тета
        |ИЗ
        |   РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь И Тема = &Тема) КАК СрезПоследних");
    Запрос.УстановитьПараметр("Пользователь", Обучающийся);
    Запрос.УстановитьПараметр("Тема",         Тема);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Тета;
    КонецЕсли;
    Возврат 0;
    
КонецФункции

// Получает откалиброванные параметры IRT задания (последняя версия).
//
Функция ПолучитьПараметрыЗадания(Знач ЗаданиеСсылка)
    
    Параметры = Новый Структура("ТрудностьB, ДискриминативностьA", 0, 1);
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   ПараметрыIRT.ТрудностьB,
        |   ПараметрыIRT.ДискриминативностьA
        |ИЗ
        |   РегистрСведений.ПараметрыIRT КАК ПараметрыIRT
        |ГДЕ
        |   ПараметрыIRT.Задание = &Задание
        |   И ПараметрыIRT.СтатусКалибровки = ЗНАЧЕНИЕ(Перечисление.СтатусыКалибровкиЗадания.Откалибровано)
        |УПОРЯДОЧИТЬ ПО
        |   ПараметрыIRT.ВерсияПараметров УБЫВ");
    Запрос.УстановитьПараметр("Задание", ЗаданиеСсылка);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Параметры.ТрудностьB         = Выборка.ТрудностьB;
        Параметры.ДискриминативностьA = Выборка.ДискриминативностьA;
    КонецЕсли;
    Возврат Параметры;
    
КонецФункции

// Получает кандидатов на следующее задание для данной темы — массив структур с параметрами IRT.
// Берётся последняя версия параметров каждого задания (без дублей по версиям).
//
// Параметры:
//  Тема - СправочникСсылка.Темы - тема, для которой подбираются задания.
//
// Возвращаемое значение:
//  Массив из Структура - Ссылка (СправочникСсылка.ТестовыеЗадания), ТрудностьB (Число),
//      ДискриминативностьA (Число).
//
Функция ПолучитьКандидатовЗаданийПоТеме(Знач Тема) Экспорт

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Задания.Ссылка                              КАК Ссылка,
        |   ЕСТЬNULL(Параметры.ТрудностьB, 0)           КАК ТрудностьB,
        |   ЕСТЬNULL(Параметры.ДискриминативностьA, 1)  КАК ДискриминативностьA
        |ИЗ
        |   Справочник.ТестовыеЗадания КАК Задания
        |   ЛЕВОЕ СОЕДИНЕНИЕ
        |       (ВЫБРАТЬ
        |           П.Задание КАК Задание,
        |           МАКСИМУМ(П.ВерсияПараметров) КАК МаксВерсия
        |        ИЗ РегистрСведений.ПараметрыIRT КАК П
        |        СГРУППИРОВАТЬ ПО П.Задание) КАК МаксВерсии
        |       ПО МаксВерсии.Задание = Задания.Ссылка
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыIRT КАК Параметры
        |       ПО Параметры.Задание = Задания.Ссылка
        |           И Параметры.ВерсияПараметров = МаксВерсии.МаксВерсия
        |ГДЕ
        |   Задания.Тема = &Тема
        |   И Задания.ВидимыйСтатус = ИСТИНА
        |   И НЕ Задания.ПометкаУдаления
        |   И Задания.ТипЗадания В (
        |       ЗНАЧЕНИЕ(Перечисление.ТипыТестовыхЗаданий.ОдиночныйВыбор),
        |       ЗНАЧЕНИЕ(Перечисление.ТипыТестовыхЗаданий.МножественныйВыбор))");
    Запрос.УстановитьПараметр("Тема", Тема);
    
    Результат = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Стр = Новый Структура("Ссылка, ТрудностьB, ДискриминативностьA");
        ЗаполнитьЗначенияСвойств(Стр, Выборка);
        Результат.Добавить(Стр);
    КонецЦикла;
    Возврат Результат;
    
КонецФункции

// Собирает историю ответов сессии в формат для оценщика θ.
//
Функция СобратьИсториюОтветовСессии(Знач Сессия)

    Задания = Новый Массив;
    Для Каждого Стр Из Сессия.Ответы Цикл
        Задания.Добавить(Стр.Задание);
    КонецЦикла;
    КартаПараметров = ПолучитьПараметрыЗаданийПакетом(Задания);

    История = Новый Массив;
    Для Каждого Стр Из Сессия.Ответы Цикл
        Параметры = КартаПараметров.Получить(Стр.Задание);
        Если Параметры = Неопределено Тогда
            Параметры = Новый Структура("ТрудностьB, ДискриминативностьA", 0, 1);
        КонецЕсли;
        История.Добавить(Новый Структура(
            "ТрудностьB, ДискриминативностьA, Верно",
            Параметры.ТрудностьB, Параметры.ДискриминативностьA, Стр.Верно));
    КонецЦикла;
    Возврат История;

КонецФункции

// Возвращает соответствие «задание -> Структура(ТрудностьB, ДискриминативностьA)»
// для набора заданий по последней откалиброванной версии параметров (один запрос).
//
Функция ПолучитьПараметрыЗаданийПакетом(Знач Задания)

    Карта = Новый Соответствие;
    Если Задания.Количество() = 0 Тогда
        Возврат Карта;
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Параметры.Задание             КАК Задание,
        |   Параметры.ТрудностьB          КАК ТрудностьB,
        |   Параметры.ДискриминативностьA КАК ДискриминативностьA
        |ИЗ
        |   (ВЫБРАТЬ
        |       П.Задание КАК Задание,
        |       МАКСИМУМ(П.ВерсияПараметров) КАК МаксВерсия
        |    ИЗ РегистрСведений.ПараметрыIRT КАК П
        |    ГДЕ П.Задание В (&Задания)
        |       И П.СтатусКалибровки = ЗНАЧЕНИЕ(Перечисление.СтатусыКалибровкиЗадания.Откалибровано)
        |    СГРУППИРОВАТЬ ПО П.Задание) КАК МаксВерсии
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыIRT КАК Параметры
        |       ПО Параметры.Задание = МаксВерсии.Задание
        |           И Параметры.ВерсияПараметров = МаксВерсии.МаксВерсия");
    Запрос.УстановитьПараметр("Задания", Задания);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Карта.Вставить(Выборка.Задание, Новый Структура(
            "ТрудностьB, ДискриминативностьA",
            Выборка.ТрудностьB, Выборка.ДискриминативностьA));
    КонецЦикла;
    Возврат Карта;

КонецФункции

// Оценивает θ — сначала через микросервис, при недоступности — локально.
//
Функция ОценитьТета(Знач Историк)
    
    // Пробуем микросервис
    Пакет = Новый Структура;
    Пакет.Вставить("ИсторияОтветов", Историк);
    Пакет.Вставить("Априор", Новый Структура("Мю, Сигма", 0, 1));
    
    Ответ = КлиентIRTСервиса.ОценитьТета(Пакет);
    Если Ответ.Успех Тогда
        // ТелоОтвета - Соответствие (ДесериализоватьИзJSON возвращает соответствие),
        // поэтому значения берем через .Получить, а не точечным доступом.
        Тета = ЗначениеТелаОтвета(Ответ.ТелоОтвета, "theta");
        SE   = ЗначениеТелаОтвета(Ответ.ТелоОтвета, "se");
        Если ТипЗнч(Тета) = Тип("Число") Тогда
            Возврат Новый Структура("Тета, SE", Тета, ?(ТипЗнч(SE) = Тип("Число"), SE, 1));
        КонецЕсли;
        // theta некорректна (null/NaN/отсутствует) - переходим на локальный расчет.
    КонецЕсли;

    // Fallback — локальный расчёт
    Локально = АдаптивноеТестированиеЛокально.ОценитьТетаЛокально(Историк);
    Возврат Новый Структура("Тета, SE", Локально.Тета, Локально.SE);

КонецФункции

// Безопасно извлекает значение по ключу из тела ответа (Соответствие или Структура).
//
Функция ЗначениеТелаОтвета(Знач Тело, Знач Ключ)

    Если ТипЗнч(Тело) = Тип("Соответствие") Тогда
        Возврат Тело.Получить(Ключ);
    ИначеЕсли ТипЗнч(Тело) = Тип("Структура") Тогда
        Значение = Неопределено;
        Тело.Свойство(Ключ, Значение);
        Возврат Значение;
    КонецЕсли;
    Возврат Неопределено;

КонецФункции

// Выбирает следующее задание — сначала через микросервис, при недоступности — локально.
//
Функция ВыбратьСледующееЗадание(Знач Кандидаты, Знач ТекущаяТета, Знач Использованные)
    
    Если Кандидаты.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Pack candidates and request the microservice
    КандидатыПакет = Новый Массив;
    Для Каждого К Из Кандидаты Цикл
        Если Использованные.Получить(К.Ссылка) = Неопределено Тогда
            КандидатыПакет.Добавить(Новый Структура(
                "Идентификатор, ТрудностьB, ДискриминативностьA",
                Строка(К.Ссылка.УникальныйИдентификатор()),
                К.ТрудностьB, К.ДискриминативностьA));
        КонецЕсли;
    КонецЦикла;
    
    Если КандидатыПакет.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Пакет = Новый Структура;
    Пакет.Вставить("ТекущаяТета", ТекущаяТета);
    Пакет.Вставить("Кандидаты", КандидатыПакет);
    
    Ответ = КлиентIRTСервиса.ВыбратьСледующееЗадание(Пакет);
    Если Ответ.Успех Тогда
        ИдВыбранного = ЗначениеТелаОтвета(Ответ.ТелоОтвета, "selected_id");
        Если ТипЗнч(ИдВыбранного) = Тип("Строка") И ЗначениеЗаполнено(ИдВыбранного) Тогда
            GUIDВыбранного = Новый УникальныйИдентификатор(ИдВыбранного);
            Возврат Справочники.ТестовыеЗадания.ПолучитьСсылку(GUIDВыбранного);
        КонецЕсли;
        // selected_id отсутствует/некорректен - переходим на локальный выбор.
    КонецЕсли;

    // Fallback — локальный выбор
    Возврат АдаптивноеТестированиеЛокально.ВыбратьЗаданиеЛокально(
        Кандидаты, ТекущаяТета, Использованные);
    
КонецФункции

// Проверка критериев остановки сессии: достижение целевой SE или лимита заданий.
//
Функция ПроверитьКритерийОстановки(Знач Сессия, Знач ОценкаТета)
    
    ЦелеваяSE = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ЦелеваяСтандартнаяОшибкаТета");
    Лимит     = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ЛимитЗаданийВСессии");
    
    Если Лимит > 0 И Сессия.ЧислоЗаданий >= Лимит Тогда
        Возврат Истина;
    КонецЕсли;
    Если ЦелеваяSE > 0 И ОценкаТета.SE <= ЦелеваяSE Тогда
        Возврат Истина;
    КонецЕсли;
    Возврат Ложь;
    
КонецФункции

#КонецОбласти
